dafoam_pytorch_hfdib_demo/cases/channel_baseline/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300.0;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            fixedValue ;
        value           uniform 305.0;
    }
}


// ************************************************************************* //
