dafoam_pytorch_hfdib_demo/cases/channel_baseline/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 1;

method          scotch;

simpleCoeffs
{
    n               (1 1 1);
    delta           0.001;
}
